//-----------------------------------------------------------------------------
/*
   vGUI的字体资源
   中文字库兰亭黑体 24

   银网科技
   Date       : 2023.12.05
*/
//-----------------------------------------------------------------------------
#ifndef GUI_FONTCHS24LTH_H
#define GUI_FONTCHS24LTH_H

#include "GUI_Type.h"
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//---------------------------------------------------------------------------
// 兰亭黑体简
// 24 x 24中英文字符
extern GUI_CONST_STORAGE  GUI_FONT GUI_CHSLTHFont24;
extern GUI_CONST_STORAGE  GUI_FONT GUI_CHSLTHFont24x2;

#define GUI_FONT_24LTH_CHN   (&GUI_CHSLTHFont24)
//---------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//---------------------------------------------------------------------------
#endif //__FONTCHS24LTH_H
