/*

    Dev_Clock
    
    毫秒级计时时钟
    由外部Timer每毫秒进行一次Tick操作
    由参数可取回日期,时间
    
    2005.3.5
    卫荣平
    
    version 1.0 创建
    
    2020.10.28
    ver1.2
    移植到GPT30
  
  2020.11.24
  v1.3
  移植到GP301
*/
//-----------------------------------------------------------------------------
#ifndef DEV_CLOCK_H
#define DEV_CLOCK_H

#include <DevTypes.h>

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif

//=============================================================================
// 全局宏定义
//-----------------------------------------------------------------------------
// 起始年份
// **修改此处要调整DayOfWeek
#define ClockYearBegin      2000
#define Days2020Since2000   7305
//=============================================================================
// 全局数据结构
//-----------------------------------------------------------------------------
// 系统时间结构
// 进行与时间相关操作的基本结构
typedef struct tagDevClock
{
  uint16_t     FDays;             // 从2000年1月1日开始的天数
           
  uint32_t     FMilSecs;          // 从当天0:0"0'000开始的毫秒数
} TDevClock;
//=============================================================================
// 全局数据
//-----------------------------------------------------------------------------
extern TDevClock      DevClock;
//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
// 初始化TSysClock
// 将时间恢复到2020-1-1 0:0'0"0
// 输入:
//   pClock: 系统时间结构
// 输出:
//   无
void DEVCLK_Init(TDevClock* pClock);
//-----------------------------------------------------------------------------
// 每毫秒一次的时间节拍
// 输入:
//   pClock: 系统时间结构
// 输出:
//   无
void DEVCLK_Tick(TDevClock* pClock);
//-----------------------------------------------------------------------------
// 取日期和时间串
// 输入:
//   pClock: 系统时间结构
// 输出:
//  pucBuf: 数据区  格式:YYMMDDHHNNSS -- "050310181103" = 2005.3.5 18:11'3"
// 返回: 1: 成功  0:失败
uint32_t DEVCLK_DateTimeString(const TDevClock* pClock, uint8_t* pucBuf);
//-----------------------------------------------------------------------------
// 取日期
// 输入:
//     pClock: 系统时间结构
// 输出:
//   返回:从2000-1-1开始的天数
#define DEVCLK_GetDate(aClock) (aClock).FDays
//-----------------------------------------------------------------------------
// 检查日期分量
// 输入:
//   y: 年
//   m: 月
//   d: 日
// 输出:
//   返回: 0: 成功 1:年错  2:月错  4:日错 --- 可以组合
int DEVCLK_CheckDatePart(uint32_t y, 
                         uint32_t m, 
                         uint32_t d);
//-----------------------------------------------------------------------------
// 取当前日期的年月日
// 输入:
//   pClock: 系统时间结构
// 输出:
//    y: 年
//    m: 月
//    d: 日
void DEVCLK_DecodeDate( const TDevClock *pClock,
                         uint32_t *y,    // 年
                         uint32_t *m,    // 月
                         uint32_t *d);   // 日
//-----------------------------------------------------------------------------
// 设置日期的年月日
// 输入:
//   pClock: 系统时间结构
//    y: 年
//    m: 月
//    d: 日
// 输出:
//    无
void DEVCLK_EncodeDate( TDevClock *pClock,
                         uint32_t  y,     // 年
                         uint32_t  m,     // 月
                         uint32_t  d);    // 日
//-----------------------------------------------------------------------------
// 取日期串
// 输入:
//   pClock: 系统时间结构
//   pucBuf: 数据区  格式:YYMMDD,如:050305=2005.3.5
// 输出:
//   返回: 1:成功  0:失败  
int DEVCLK_DateString(TDevClock* pClock, uint8_t* pucBuf);
//-----------------------------------------------------------------------------
// 用日期串设置日期
// 输入:
//   pClock: 系统时间结构
//   pucBuf: 数据区  格式:YYMMDD,如:050305=2005.3.5
// 输出:
//   无
void DEVCLK_SetDateByString(TDevClock* pClock, uint8_t*pucBuf);
//-----------------------------------------------------------------------------
// 填写日期到数据区
// 输入:
//   pClock: 日期时间结构
//  pucBuf: 数据区指针
// 输出:
//   填写的长度  
int DEVCLK_FillDate2Buf(const TDevClock* pClock, uint8_t* pucBuf);
//-----------------------------------------------------------------------------
// 检查时间分量
// 输入:
//   h: 时
//   m: 分
//   s: 秒
//   u: 毫秒
// 输出:
//   返回: 0: 成功 1:时错  2:分错  4:秒错 8:毫秒错 --- 可以组合
int DEVCLK_CheckTimePart( uint32_t h, 
                          uint32_t m, 
                          uint32_t s, 
                          uint32_t u);
//-----------------------------------------------------------------------------
// 取时间
// 输入:
//   pClock: 日期时间结构
// 输出:
//   返回: 当天0:0'0"0到当前的毫秒数
#define DEVCLK_GetTime(aClock)       (aClock).FMilSecs
//-----------------------------------------------------------------------------
// 取当前时间的时、分、秒、毫秒
// 输入:
//   pClock: 日期时间结构
// 输出:
//    h: 时
//    m: 分
//    s: 秒
//    u: 毫秒
void DEVCLK_DecodeTime( const TDevClock *pClock,
                        uint32_t  *h,    // 时
                        uint32_t  *m,    // 分
                        uint32_t  *s,    // 秒
                        uint32_t  *u);   // 毫秒
//-----------------------------------------------------------------------------
// 设置时间的时、分、秒、毫秒
// 输入:
//   pClock: 日期时间结构
//    h: 时
//    m: 分
//    s: 秒
//    u: 毫秒
// 输出:
//   无
void DEVCLK_EncodeTime( TDevClock *pClock,
                        uint32_t   h,     // 时
                        uint32_t   m,     // 分
                        uint32_t   s,     // 秒
                        uint32_t   u);    // 毫秒
//-----------------------------------------------------------------------------
// 时间校正
// 输入:
//   pClock: 日期时间结构
//   iDiffDays: 时间差, 以ms为单位 >0时向后调整 <0时向前调整
// 输出:
//   无
// 返回:
//   无
void DEVCLK_TimeCorrect(TDevClock* pClock, int iDiffDays);
//-----------------------------------------------------------------------------
// 时间校正
// 按分量校正
// 输入:
//  date: 日期
//  time: 时间
//    iDiffDays: 时间差, 以ms为单位 >0时向后调整 <0时向前调整
// 输出:
//   无
// 返回:
//   无
void DEVCLK_TimeCorrect2(uint32_t *date, uint32_t *time, int iDiffDays);
//-----------------------------------------------------------------------------
// 取时间串
// 输入:
//   pClock: 日期时间结构
// 输出:
//  pucBuf: 数据区  格式:HHMMSS,如:142213=14:22"13'
// 返回: 1:成功  0:失败  
int DEVCLK_TimeString(const TDevClock* pClock, uint8_t *pucBuf);
//-----------------------------------------------------------------------------
// 用时间串设置时间
// 输入:
//   pClock: 日期时间结构
//  pucBuf: 数据区  格式:HHMMSS,如:142213=14:22"13'
// 输出:
//   返回: 1:成功  0:失败  
void DEVCLK_SetTimeByString(TDevClock* pClock, uint8_t*pucBuf);
//-----------------------------------------------------------------------------
// 填写时间到数据区
// 输入:
//   pClock: 日期时间结构
//  pucBuf: 数据区指针
// 输出:
//   填写的长度  
int DEVCLK_FillTime2Buf(TDevClock* pClock, uint8_t* pucBuf);
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 取每个月份的天数(非闰年)
// 输入:
//   m: 月份  1~12
// 输出:
//   返回: 0:不正确的月份 >0:当月天数(非闰年)
uint32_t DEVCLK_DaysOfMonth(uint32_t m);
//-----------------------------------------------------------------------------
// 当前日期是星期几？
// 输入:
//   pClock: 日期时间结构
//  pucBuf: 数据区指针
// 输出:
//   返回: 1~7: Sunday Monday ...
uint32_t DEVCLK_DayOfWeek(TDevClock* pClock);
//-----------------------------------------------------------------------------
// 测试指定年份是否闰年
// 输入:
//   y: 年
// 返回:  0:正常年   1:闰年
uint32_t DEVCLK_IsLeapyear(uint32_t y);
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 读取时间
// 输入:
//   pClock: 日期时间结构
// 输出：
//   pTime:  数据区
// 返回: 无
void DEVCLK_GetDateTime(const TDevClock* pClock, TDateTimeType* pTime);
//-----------------------------------------------------------------------------
// 设置时间
// 输入:
//   pClock: 日期时间结构
//   pTime:  数据区
// 返回: 无
void DEVCLK_SetDateTime(TDevClock* pClock, const TDateTimeType* pTime);
//-----------------------------------------------------------------------------
// 填写事件摘要中的时间区域
// 输入:
//   pClock: 日期时间结构
// 输出：
//   pSummary:  数据区
// 返回: 无
void DEVCLK_FillEventSummary( const TDevClock* pClock, 
                              TEventLogSummary* pSummary );
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 检查日期时间
// 输入:
//   pTime: 日期时间
// 输出:
//   返回: 0: 成功;  !=0: 失败
int DEVCLK_CheckDateTime( TDateTimeType* pTime );
//-----------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif // DEV_CLOCK_H
